{
  "heroTitle": "Innovations in Maritime Engineering",
  "introduction": "Association of Friends of Technical Science",
  "explore": "Explore our projects and learn more about our mission!",
  "home": {
    "headline": "Promoting Technical Sciences and Innovation",
    "subheading": "Empowering the next generation of innovators through education, research, and collaboration",
    "callToAction": "View Our Projects",
    "aboutSection": "About Us",
    "aboutText": "UPTZ brings together enthusiasts, students, and professionals passionate about technology and its applications. Founded in 2020, we aim to make technical knowledge accessible to everyone.",
    "projectsSection": "Our Projects",
    "projectsSectionDescription": "Innovative Solutions by Our Team Members",
    "partnersSection": "Our Partners"
  },
  "menu": {
    "home": "Home",
    "aboutUs": "About Us",
    "projects": "Projects",
    "partners": "Our Partners",
    "openSource": "Open Source",
    "contact": "Contact"
  },
  "about": {
    "subsection1": {
      "title": "Wilson",
      "description": "Wilson is an advanced electric racing boat that achieved outstanding success at international competitions this year, securing 4th place in the most demanding endurance race and 2nd place in both slalom and elimination races. The vessel is powered by a robust 20kW electric motor and 10kWh Li-Ion battery pack that enables reaching maximum speeds of 25 knots. The construction is reinforced with carbon tubes, and the cockpit design incorporates elements of the Croatian flag with special emphasis on the red and white checkerboard pattern."
    },
    "subsection2": {
      "title": "Malo Vitra",
      "description": "\"Malo vitra\" is a prototype racing catamaran developed by students as part of the Adria Energy Boat Class project. It's powered by renewable energy sources, utilizing solar cells to drive an electric motor without CO2 emissions. The vessel features a lightweight yet strong carbon fiber composite construction and achieved a top speed of 11.8 knots, showcasing innovative sustainable technology in maritime mobility."
    },
    "subsection3": {
      "title": "Teredo Navalis",
      "description": "\"Teredo Navalis\" is a solar-powered boat designed and built by students for the Monaco Energy Boat Challenge. Constructed with a lightweight sandwich of styrofoam, PET, carbon, and glass fibers, it achieves a maximum speed of 16 knots using a 1.5 kWh battery pack and 1300 W solar cells, demonstrating sustainable nautical technology."
    }
  },
  "competitions": {
    "hydroContest": {
      "name": "HydroContest",
      "description": "An international student competition focused on energy efficiency in sea transport. Teams design and build radio-controlled vessels powered by renewable energy sources."
    },
    "monacoEnergyBoatChallenge": {
      "name": "Monaco Energy Boat Challenge",
      "description": "A prestigious event where teams from around the world compete with their energy-efficient boats, showcasing innovation in maritime technology."
    },
    "adriaHydrofoil": {
      "name": "Adria Hydrofoil",
      "description": "A regional competition promoting the development of hydrofoil technology in the Adriatic region, encouraging students to innovate in marine engineering."
    },
    "adriaEnergyBoatClass": {
      "name": "Adria Energy Boat Class",
      "description": "A competition that challenges students to design and build energy-efficient boats, focusing on renewable energy solutions and sustainable maritime practices."
    }
  },
  "projects": {
    "projectList": {
      "deltaOne": "Delta One",
      "maloVitra": "Malo Vitra",
      "teredoNavalis": "Teredo Navalis",
      "wilson": "Wilson",
      "hydroconx": "HydroConX"
    },
    "driveSystem": "Drive System",
    "viewDetails": "View Details",
    "backToProjects": "Back to Projects",
    "features": "Features",
    "technology": "Technology",
    "technical": "Technical Specifications",
    "overview": "Project Overview",
    "team": "Team",
    "shortDesc": {
      "deltaOne": "Our first prototype boat for the competition was named Delta One because the boat was created as part of the Rowing club Jadran Rijeka located at Delta 1. The vessel began... ",
      "maloVitra": "Our team developed its new vessel called \"Malo vitra\". It is a prototype racing catamaran powered by renewable energy sources via solar cells without the use of CO2 that...",
      "teredoNavalis": "Our second boat for the competition was named Teredo Navalis after the shipworm. The design and construction of the boat began in 2021 and was successfully completed...",
      "wilson": "Our electric racing boat Wilson achieved international success with 4th place in endurance and 2nd in slalom. Features 20kW motor, 10kWh battery, 25-knot top speed, and Croatian-inspired design.",
      "hydroConX": "HydroContest is the first international student competition and incubator of ideas devoted to energy efficiency in sea transport. Teams have a task to independently design and build..."
    },
    "detail": {
      "deltaOne": {
        "overview": "Delta One is an autonomous underwater vehicle designed for underwater exploration and research. It represents our flagship project in marine robotics.",
        "features": {
          "feature1": "Advanced sonar mapping capabilities",
          "feature2": "Autonomous navigation and obstacle avoidance",
          "feature3": "Real-time data transmission to surface stations"
        },
        "technical": "Delta One uses a combination of advanced sensors, custom propulsion systems, and proprietary software for control and navigation. The main hull is constructed from carbon fiber for optimal strength-to-weight ratio."
      },
      "maloVitra": {
        "driveSystemDesc": "The propulsion system is based on a mix of currently available sustainable technologies.",
        "overview": "Malo Vitra is an educational platform about renewable energy sources, with a focus on wind energy.",
        "features": {
          "feature1": "Interactive models of small wind turbines",
          "feature2": "Educational materials tailored for different age groups",
          "feature3": "Assembly kits for hands-on learning"
        },
        "technical": "The project uses 3D-printed components, low-power microcomputers, and solar cells to demonstrate sustainable energy solutions.",
        "specs": {
          "maxSpeed": {
            "title": "Max Speed",
            "value": "11.8",
            "unit": "knots",
            "description": "is maximum speed that vessel can achieve."
          },
          "solarPower": {
            "title": "Solar Power",
            "value": "600",
            "unit": "W",
            "description": "Total solar panel capacity for sustainable energy generation"
          },
          "propulsion": {
            "title": "Propulsion",
            "value": "6",
            "unit": "kW",
            "description": "of total power with E-propulsion Navy outboard engine that works on 48V."
          },
          "solarPanels": {
            "title": "Solar Panels",
            "value": "2.1",
            "unit": "m²",
            "description": "of 9S high-efficiency photovoltaic monocrystalline panels."
          },
          "batteryCapacity": {
            "title": "Battery",
            "value": "9",
            "unit": "kWh",
            "description": "of total capacity with E-propulsion LiFePo4 battery pack E175."
          },
          "weight": {
            "title": "Weight",
            "value": "85",
            "unit": "kg",
            "description": "Total vessel weight including all systems and equipment"
          },
          "length": {
            "title": "Length",
            "value": "4.2",
            "unit": "m",
            "description": "Overall length of the catamaran hull design"
          },
          "range": {
            "title": "Range",
            "value": "25",
            "unit": "km",
            "description": "Maximum operational range on full battery charge"
          },
          "vesselParameters": {
            "title": "Vessel Parameters",
            "value": "32",
            "unit": "kg",
            "description": "is weight of the cockpit. The total weight of the vessel with all equipment is 246kg."
          }
        },
        "vesselConstruction": {
          "title": "Vessel Construction",
          "cockpitConstruction": {
            "title": "Cockpit Construction",
            "points": [
              "Vacuum infusion molding process by Marservis d.o.o. from Kaštelir",
              "Basic laminate: 2 layers of carbon 200 g/m² roving with epoxy resin",
              "Bottom reinforced with Soric XF 135 g/m² sandwich core construction",
              "8 additional layers in cockpit abutment area on carbon tubes",
              "Driver's bulkhead and outer decks with 10mm AIREX T92 PET core",
              "Locally reinforced areas in driver's compartment and battery housing"
            ]
          },
          "motorSupport": {
            "title": "Motor Support",
            "points": [
              "Sandwich construction with 25mm thickness for maximum stiffness",
              "PVC core 200 g/m³ with superior structural properties",
              "2 layers of carbon fiber on both inside and outside surfaces",
              "Same carbon fiber grammage as hull for consistency",
              "Bonded to transom using structural adhesive for durability"
            ]
          },
          "structuralDesign": {
            "title": "Structural Design",
            "points": [
              "Deck made of 2 layers of carbon fiber with local stiffening",
              "Forward hull and deck bonded with methacrylate-based structural glue",
              "Rear section screwed to aluminum frame with waterproof sealing",
              "Battery and electronics area with specialized joint sealing",
              "Recycled AIREX T92 PET core materials from previous vessels"
            ]
          }
        },
        "gallery": {
          "title": "Project Gallery",
          "images": {
            "vessel_overview": "Malo Vitra catamaran in action",
            "construction_detail": "Carbon fiber construction details",
            "cockpit_view": "Cockpit and control systems",
            "propulsion_system": "Electric propulsion system",
            "solar_panels": "Solar panel installation"
          },
          "captions": {
            "vessel_overview": "Malo Vitra during testing - showcasing the sleek catamaran design",
            "construction_detail": "Advanced carbon fiber construction with vacuum infusion process",
            "cockpit_view": "Ergonomic cockpit design with integrated control systems",
            "propulsion_system": "High-efficiency electric motor and propulsion system",
            "solar_panels": "600W solar panels providing sustainable energy"
          }
        },
        "projectDetails": {
          "title": "Additional Project Information",
          "details": [
            {
              "title": "Project Overview",
              "description": "Malo Vitra is our team's latest innovative vessel - a prototype racing catamaran powered entirely by renewable energy sources via solar cells, operating without CO2 emissions. The vessel features an advanced electric propulsion system that supplies power to the outboard electric motor, representing a breakthrough in sustainable maritime technology.",
              "category": "Overview"
            },
            {
              "title": "Competition Performance",
              "description": "In the Adria Energy Boat Class competition, the Rijeka team achieved outstanding results among 13 international teams. They secured 3rd place on the podium in the most demanding endurance race, 5th place in both slalom and elimination races, finishing 4th overall. This represents the best result in the young team's history, demonstrating exceptional performance in sustainable maritime technology.",
              "category": "Achievement"
            },
            {
              "title": "Environmental Impact",
              "description": "Zero-emission propulsion system with regenerative capabilities. Solar panels provide sustainable energy, making it completely environmentally friendly for marine ecosystems.",
              "category": "Sustainability"
            },
            {
              "title": "Custom Propeller Design",
              "description": "The propeller was independently designed and manufactured using additive printing technology with a combination of carbon fiber and nylon at 100% filling density. This innovative propulsion component enabled the vessel to achieve its impressive maximum speed of 11.8 knots, demonstrating the effectiveness of advanced 3D printing in marine applications.",
              "category": "Innovation"
            },
            {
              "title": "Team Collaboration",
              "description": "Developed through interdisciplinary collaboration between naval architecture students, electrical engineers, and composite material specialists from University of Rijeka.",
              "category": "Teamwork"
            },
            {
              "title": "Technical Challenges",
              "description": "Overcoming complex hydrodynamic challenges, optimizing battery management systems, and integrating solar charging while maintaining competitive weight limits.",
              "category": "Engineering"
            },
            {
              "title": "Future Development",
              "description": "Plans include implementing autonomous navigation systems, advanced energy management algorithms, and exploring hydrogen fuel cell integration for extended range.",
              "category": "Future"
            },
            {
              "title": "Academic Research Context",
              "description": "Adria Energy Boat Class is an interdisciplinary research program combining students, academics, and industry professionals to advance sustainable maritime technology. The initiative focuses on renewable energy integration, electric propulsion systems, and energy storage optimization. Through international competitions, the program bridges theoretical research with practical applications in sustainable marine transportation.",
              "category": "Research"
            }
          ]
        }
      },
      "teredoNavalis": {
        "overview": "Teredo Navalis is a system for monitoring and protecting wooden maritime structures from damaging marine organisms.",
        "features": {
          "feature1": "Sensor systems for early detection of biological threats",
          "feature2": "Environmentally friendly protective agents",
          "feature3": "Platform for long-term condition monitoring"
        },
        "technical": "This project combines advanced vibration detection sensors, waterproof computing systems, and specialized coatings for protecting wooden structures in marine environments."
      },
      "wilson": {
        "overview": "Wilson is an autonomous robot designed to assist in forest research and monitoring of forest ecosystems.",
        "features": {
          "feature1": "Self-navigation over rough terrain",
          "feature2": "Advanced sensors for analyzing flora and fauna",
          "feature3": "Solar charging for extended field operation"
        },
        "specs": {
          "maxSpeed": {
            "title": "Max Speed",
            "value": "25",
            "unit": "knots",
            "description": "is maximum speed that vessel can achieve."
          },
          "propulsion": {
            "title": "Propulsion",
            "value": "20",
            "unit": "kW",
            "description": "of E-Propulsion Navy 20 outboard electric motor"
          },
          "solarPanels": {
            "title": "Solar Panels",
            "value": "2.1",
            "unit": "m²",
            "description": "of 9S high-efficiency photovoltaic monocrystalline panels."
          },
          "batteryCapacity": {
            "title": "Battery",
            "value": "10",
            "unit": "kWh",
            "description": "custom Li-Ion battery"
          },
          "vesselParameters": {
            "title": "Vessel Parameters",
            "value": "20",
            "unit": "kg",
            "description": "is of weight of the cockpit. The total weight of the vessel with all equipment is 120kg without the hulls. Hulls weigh 60kg."
          }
        },
        "vesselConstruction": {
          "title": "Vessel Construction",
          "cockpitConstruction": {
            "title": "Cockpit Construction",
            "points": [
              "Closed-type design with battery and electronics in separate compartment",
              "All electronic components housed behind driver's bulkhead for safety",
              "Longitudinal reinforcement with two carbon tubes (50mm outer diameter)",
              "Carbon tube wall thickness of 2mm for optimal strength-to-weight ratio",
              "Croatian flag elements integrated into exterior cockpit design",
              "Red checkerboard pattern emphasizing national identity and pride"
            ]
          },
          "motorSupport": {
            "title": "Engine Mount & Propulsion",
            "points": [
              "Carbon fiber sandwich structure for lightweight performance",
              "High strength construction combining advanced composite materials",
              "Waterjet-cut components for precision manufacturing",
              "Prepreg materials molded parts for optimal quality",
              "20kW Edyn 2035 outboard electric motor integration",
              "Hydraulic steering system with steering wheel control"
            ]
          },
          "structuralDesign": {
            "title": "Advanced Manufacturing",
            "points": [
              "Vacuum infusion fabrication techniques for superior quality",
              "Oven-cured prepregs ensuring structural integrity",
              "10kWh Li-Ion battery pack with maximum capacity design",
              "Maximum speed capability of 25 knots achievement",
              "Modern and dynamic design reflecting national pride",
              "Advanced composite techniques throughout construction process"
            ]
          }
        },
        "gallery": {
          "title": "Project Gallery",
          "images": {
            "vessel_overview": "Wilson racing boat in action",
            "construction_detail": "Carbon fiber construction details",
            "cockpit_view": "Cockpit and control systems",
            "propulsion_system": "Electric propulsion system",
            "solar_panels": "Solar panel installation"
          },
          "captions": {
            "vessel_overview": "Wilson during racing - showcasing the sleek design and Croatian flag elements",
            "construction_detail": "Advanced carbon fiber construction with sandwich structure",
            "cockpit_view": "Closed-type cockpit design with integrated electronics compartment",
            "propulsion_system": "20kW electric motor and hydraulic steering system",
            "solar_panels": "High-efficiency solar panels for sustainable energy"
          }
        },
        "projectDetails": {
          "title": "Additional Project Information",
          "details": [
            {
              "title": "Project Overview",
              "description": "Wilson is our advanced electric racing boat that represents a breakthrough in sustainable marine technology. With its closed-type cockpit design and integrated Croatian flag elements, it combines performance with national identity. The vessel achieved remarkable success in international competitions, demonstrating the effectiveness of electric propulsion in competitive maritime environments.",
              "category": "Overview"
            },
            {
              "title": "Competition Performance",
              "description": "This year, the team from Rijeka reached 4th place in the most demanding endurance race, while they achieved 2nd place in the slalom race and the elimination race, which made them get onto the podium in 2nd place. 17 teams from all over the world took part in the competition, and their placement is also the best result of this young team.",
              "category": "Achievement"
            },
            {
              "title": "Environmental Impact",
              "description": "Powered entirely by electric propulsion with Li-Ion battery technology, Wilson operates with zero direct emissions. The vessel demonstrates that high-performance racing can be achieved sustainably, paving the way for cleaner marine transportation technologies.",
              "category": "Sustainability"
            },
            {
              "title": "Innovation Features",
              "description": "Wilson incorporates cutting-edge carbon fiber sandwich construction, precision waterjet-cut components, and advanced prepreg materials. The integration of hydraulic steering with electric propulsion represents a significant advancement in marine control systems.",
              "category": "Innovation"
            },
            {
              "title": "Cultural Design",
              "description": "The exterior cockpit design incorporates elements of the Croatian national flag with special emphasis on the red checkerboard pattern. This design reflects national pride and identity through modern and dynamic aesthetics, making Wilson a true ambassador of Croatian engineering excellence.",
              "category": "Custom Design"
            },
            {
              "title": "Team Collaboration",
              "description": "Developed through intensive collaboration between naval architecture students, electrical engineers, and composite material specialists. The project brought together expertise from multiple disciplines to create a world-class racing vessel.",
              "category": "Teamwork"
            },
            {
              "title": "Technical Excellence",
              "description": "Advanced manufacturing techniques including vacuum infusion and oven-cured prepregs ensure optimal structural integrity. The longitudinal carbon tube reinforcement and specialized battery compartment design represent engineering innovation at its finest.",
              "category": "Engineering"
            },
            {
              "title": "Future Development",
              "description": "Plans include exploring advanced battery management systems, regenerative charging capabilities, and further optimization of the hull design for even better racing performance while maintaining environmental sustainability.",
              "category": "Future"
            }
          ]
        },
        "technical": "The robot uses GPS-free navigation systems, highly durable materials, and specialized algorithms for natural pattern recognition."
      }
    },
    "feature3": "Assembly kits for hands-on learning"
  },

  "teredoNavalis": {
    "description": "Teredo Navalis is a system for monitoring and protecting wooden maritime structures from damaging marine organisms.",
    "feature1": "Sensor systems for early detection of biological threats",
    "feature2": "Environmentally friendly protective agents",
    "feature3": "Platform for long-term condition monitoring",
    "technology": "This project combines advanced vibration detection sensors, waterproof computing systems, and specialized coatings for protecting wooden structures in marine environments.",
    "team": "The project is developed by marine biologists, material protection specialists, and programmers specialized in environmental monitoring systems."
  },

  "wilson": {
    "description": "Wilson is an autonomous robot designed to assist in forest research and monitoring of forest ecosystems.",
    "feature1": "Self-navigation over rough terrain",
    "feature2": "Advanced sensors for analyzing flora and fauna",
    "feature3": "Solar charging for extended field operation",
    "technology": "The robot uses GPS-free navigation systems, highly durable materials, and specialized algorithms for natural pattern recognition.",
    "team": "The team includes robotics experts, ecologists, and programmers specialized in computer vision and artificial intelligence algorithms."
  },

  "maloVitra": {
    "description": "Malo Vitra is an educational platform about renewable energy sources, with a focus on wind energy.",
    "feature1": "Interactive models of small wind turbines",
    "feature2": "Educational materials tailored for different age groups",
    "feature3": "Assembly kits for hands-on learning",
    "technology": "The project uses 3D-printed components, low-power microcomputers, and solar cells to demonstrate sustainable energy solutions.",
    "team": "The team consists of renewable energy experts, educational program designers, and engineers with experience in prototype development."
  },

  "common": {
    "underConstruction": "This page is currently under construction.",
    "comingSoon": "Coming Soon",
    "loading": "Loading...",
    "readMore": "Read More",
    "language": "Language",
    "backToProjects": "Back to Projects",
    "contactUs": "Contact Us"
  },

  "contact": {
    "getInTouch": "Get In Touch",
    "reachOut": "Feel free to reach out with any questions or inquiries. We're here to help!",
    "email": "Email",
    "address": "Address",
    "form": {
      "name": "Your Name",
      "email": "Your Email",
      "message": "Your Message",
      "send": "Send Message"
    },
    "contactForm": "Contact Form"
  },
  "aboutUs": {
    "mission": {
      "title": "Our Mission",
      "description": "Our mission is to promote technical sciences and innovation through education, research, and collaboration. We aim to make technical knowledge accessible to everyone, regardless of their background."
    },
    "vision": {
      "title": "Our Vision",
      "description": "We envision a future where technical knowledge is shared freely and openly, enabling individuals and communities to solve problems and create innovative solutions to global challenges."
    },
    "history": {
      "title": "Our History",
      "description": "Founded in 2020, UPTZ began as a small group of enthusiasts with a shared passion for technology and education. Since then, we've grown into a diverse community of students, professionals, and hobbyists working together on exciting projects."
    }
  },
  "partners": {
    "introduction": "Together We Achieve More",
    "visitWebsite": "Visit Website",
    "redirectTo": "All partners",
    "list": {
      "partner1": {
        "name": "University of Zagreb",
        "description": "Academic collaboration on research projects and student engagement."
      },
      "partner2": {
        "name": "Tech Innovation Hub",
        "description": "Joint workshops and innovation challenges focusing on emerging technologies."
      },
      "partner3": {
        "name": "Green Energy Initiative",
        "description": "Collaboration on sustainable technology projects and renewable energy solutions."
      }
    }
  },
  "openSource": {
    "introduction": {
      "title": "Our Open Source Philosophy",
      "description": "We believe in the power of open source to drive innovation and collaboration. By sharing our work openly, we contribute to the global community of knowledge and enable others to build upon our foundations."
    },
    "ourRepositories": "Our GitHub Repositories",
    "viewOnGithub": "View on GitHub",
    "contribute": {
      "title": "How to Contribute",
      "description": "We welcome contributions from developers, designers, and anyone interested in our projects. Whether you're fixing a bug, improving documentation, or adding new features, your contributions help make our projects better.",
      "getInTouch": "Interested in contributing but not sure where to start? Get in touch with us!"
    },
    "repos": {
      "repo1": {
        "name": "Project Delta One",
        "description": "Open source code for underwater vehicle control systems and navigation algorithms."
      },
      "repo2": {
        "name": "Educational Wind Energy Kit",
        "description": "3D printing files and software for the Malo Vitra educational platform."
      },
      "repo3": {
        "name": "Forest Monitoring Tools",
        "description": "Software and hardware designs for environmental monitoring systems used in Project Wilson."
      }
    }
  },
  "footer": {
    "description": "UPTZ brings together enthusiasts, students, and professionals passionate about technology and its applications. We make technical knowledge accessible to everyone.",
    "quickLinks": "Quick Links",
    "contact": "Contact",
    "address": "Ante Kovačića 17, 51000 Rijeka, Croatia",
    "phone": " +385 98 9176039",
    "email": "uptzri@gmail.com",
    "followUs": "Follow Us",
    "socialDescription": "Stay connected with us on social media for updates and news.",
    "donations": "Support Us",
    "donationDescription": "The money raised by donations covers the cost of components for our boat. Even a small gesture is a great help to our team.",
    "donationMethods": {
      "bankTransfer": {
        "title": "IBAN:",
        "details": "HR1224020061100904416"
      },
      "paypal": {
        "title": "PayPal:",
        "details": "uptzri@gmail.com"
      }
    },
    "donateButton": "Make a Donation",
    "donationNote": "Your support helps fund our projects and educational initiatives.",
    "copyright": {
      "upper": "COPYRIGHT © 2023 UPTZ",
      "lower": "• All rights reserved."
    },
    "privacy": "Privacy Policy",
    "terms": "Terms of Service",
    "RWT": "RitehWebTeam, 2023.",
    "burzaNautike": "MEDIA PARTNER"
  }
}
